export default class { // Тестовый эксперимент
  static id = 'pseBLMv2l8UtBtbwEc7n';
  static name = 'Скрипты';
  static Host;
  static methods = {
    'Выполнить': async ($objectDocument) => {
      const regions = [
        {
          "id": "6",
          "label": "г. Москва",
          "value": "77"
        },
        {
          "id": "7",
          "label": "г. Санкт-Петербург",
          "value": "78"
        },
        {
          "id": "8",
          "label": "Алтайский край",
          "value": "22"
        },
        {
          "id": "9",
          "label": "Амурская область",
          "value": "28"
        },
        {
          "id": "10",
          "label": "Архангельская область",
          "value": "29"
        },
        {
          "id": "11",
          "label": "Астраханская область",
          "value": "30"
        },
        {
          "id": "12",
          "label": "Белгородская область",
          "value": "31"
        },
        {
          "id": "13",
          "label": "Брянская область",
          "value": "32"
        },
        {
          "id": "14",
          "label": "Владимирская область",
          "value": "33"
        },
        {
          "id": "15",
          "label": "Волгоградская область",
          "value": "34"
        },
        {
          "id": "16",
          "label": "Вологодская область",
          "value": "35"
        },
        {
          "id": "17",
          "label": "Воронежская область",
          "value": "36"
        },
        {
          "id": "18",
          "label": "г. Байконур",
          "value": "99"
        },
        {
          "id": "19",
          "label": "г. Севастополь",
          "value": "92"
        },
        {
          "id": "20",
          "label": "Донецкая Народная Республика",
          "value": "93"
        },
        {
          "id": "21",
          "label": "Еврейская АО",
          "value": "79"
        },
        {
          "id": "22",
          "label": "Забайкальский край",
          "value": "75"
        },
        {
          "id": "23",
          "label": "Запорожская область",
          "value": "90"
        },
        {
          "id": "24",
          "label": "Ивановская область",
          "value": "37"
        },
        {
          "id": "25",
          "label": "Иркутская область",
          "value": "38"
        },
        {
          "id": "26",
          "label": "Кабардино-Балкарская республика",
          "value": "07"
        },
        {
          "id": "27",
          "label": "Калининградская область",
          "value": "39"
        },
        {
          "id": "28",
          "label": "Калужская область",
          "value": "40"
        },
        {
          "id": "29",
          "label": "Камчатский край",
          "value": "41"
        },
        {
          "id": "30",
          "label": "Карачаево-Черкесская республика",
          "value": "09"
        },
        {
          "id": "31",
          "label": "Кемеровская область",
          "value": "42"
        },
        {
          "id": "32",
          "label": "Кировская область",
          "value": "43"
        },
        {
          "id": "33",
          "label": "Костромская область",
          "value": "44"
        },
        {
          "id": "34",
          "label": "Краснодарский край",
          "value": "23"
        },
        {
          "id": "35",
          "label": "Красноярский край",
          "value": "24"
        },
        {
          "id": "36",
          "label": "Курганская область",
          "value": "45"
        },
        {
          "id": "37",
          "label": "Курская область",
          "value": "46"
        },
        {
          "id": "38",
          "label": "Ленинградская область",
          "value": "47"
        },
        {
          "id": "39",
          "label": "Липецкая область",
          "value": "48"
        },
        {
          "id": "40",
          "label": "Луганская Народная Республика",
          "value": "94"
        },
        {
          "id": "41",
          "label": "Магаданская область",
          "value": "49"
        },
        {
          "id": "42",
          "label": "Московская область",
          "value": "50"
        },
        {
          "id": "43",
          "label": "Мурманская область",
          "value": "51"
        },
        {
          "id": "44",
          "label": "Ненецкий АО",
          "value": "83"
        },
        {
          "id": "45",
          "label": "Нижегородская область",
          "value": "52"
        },
        {
          "id": "46",
          "label": "Новгородская область",
          "value": "53"
        },
        {
          "id": "47",
          "label": "Новосибирская область",
          "value": "54"
        },
        {
          "id": "48",
          "label": "Омская область",
          "value": "55"
        },
        {
          "id": "49",
          "label": "Оренбургская область",
          "value": "56"
        },
        {
          "id": "50",
          "label": "Орловская область",
          "value": "57"
        },
        {
          "id": "51",
          "label": "Пензенская область",
          "value": "58"
        },
        {
          "id": "52",
          "label": "Пермский край",
          "value": "59"
        },
        {
          "id": "53",
          "label": "Приморский край",
          "value": "25"
        },
        {
          "id": "54",
          "label": "Псковская область",
          "value": "60"
        },
        {
          "id": "55",
          "label": "Республика Адыгея",
          "value": "01"
        },
        {
          "id": "56",
          "label": "Республика Алтай",
          "value": "04"
        },
        {
          "id": "57",
          "label": "Республика Башкортостан",
          "value": "02"
        },
        {
          "id": "58",
          "label": "Республика Бурятия",
          "value": "03"
        },
        {
          "id": "59",
          "label": "Республика Дагестан",
          "value": "05"
        },
        {
          "id": "60",
          "label": "Республика Ингушетия",
          "value": "06"
        },
        {
          "id": "61",
          "label": "Республика Калмыкия",
          "value": "08"
        },
        {
          "id": "62",
          "label": "Республика Карелия",
          "value": "10"
        },
        {
          "id": "63",
          "label": "Республика Коми",
          "value": "11"
        },
        {
          "id": "64",
          "label": "Республика Крым",
          "value": "91"
        },
        {
          "id": "65",
          "label": "Республика Марий Эл",
          "value": "12"
        },
        {
          "id": "66",
          "label": "Республика Мордовия",
          "value": "13"
        },
        {
          "id": "67",
          "label": "Республика Саха Якутия",
          "value": "14"
        },
        {
          "id": "68",
          "label": "Республика Северная Осетия - Алания",
          "value": "15"
        },
        {
          "id": "69",
          "label": "Республика Татарстан",
          "value": "16"
        },
        {
          "id": "70",
          "label": "Республика Тыва",
          "value": "17"
        },
        {
          "id": "71",
          "label": "Республика Хакасия",
          "value": "19"
        },
        {
          "id": "72",
          "label": "Ростовская область",
          "value": "61"
        },
        {
          "id": "73",
          "label": "Рязанская область",
          "value": "62"
        },
        {
          "id": "74",
          "label": "Самарская область",
          "value": "63"
        },
        {
          "id": "75",
          "label": "Саратовская область",
          "value": "64"
        },
        {
          "id": "76",
          "label": "Сахалинская область",
          "value": "65"
        },
        {
          "id": "77",
          "label": "Свердловская область",
          "value": "66"
        },
        {
          "id": "78",
          "label": "Смоленская область",
          "value": "67"
        },
        {
          "id": "79",
          "label": "Ставропольский край",
          "value": "26"
        },
        {
          "id": "80",
          "label": "Тамбовская область",
          "value": "68"
        },
        {
          "id": "81",
          "label": "Тверская область",
          "value": "69"
        },
        {
          "id": "82",
          "label": "Томская область",
          "value": "70"
        },
        {
          "id": "83",
          "label": "Тульская область",
          "value": "71"
        },
        {
          "id": "84",
          "label": "Тюменская область",
          "value": "72"
        },
        {
          "id": "85",
          "label": "Удмуртская республика",
          "value": "18"
        },
        {
          "id": "86",
          "label": "Ульяновская область",
          "value": "73"
        },
        {
          "id": "87",
          "label": "Хабаровский край",
          "value": "27"
        },
        {
          "id": "88",
          "label": "Ханты-Мансийский АО - Югра",
          "value": "86"
        },
        {
          "id": "89",
          "label": "Херсонская область",
          "value": "95"
        },
        {
          "id": "90",
          "label": "Челябинская область",
          "value": "74"
        },
        {
          "id": "91",
          "label": "Чеченская республика",
          "value": "20"
        },
        {
          "id": "92",
          "label": "Чувашская республика",
          "value": "21"
        },
        {
          "id": "93",
          "label": "Чукотский АО",
          "value": "87"
        },
        {
          "id": "94",
          "label": "Ямало-Ненецкий АО",
          "value": "89"
        },
        {
          "id": "95",
          "label": "Ярославская область",
          "value": "76"
        }
      ];
      
      const regionClassItem = this.Host.getClassById('uTENpePju8yYMlroiQOq');
      const objDocs = await regionClassItem.getObjectDocuments();
      objDocs.forEach(d => {
        const objDocItem = this.Host.getObjectDocumentByReference(d.reference);
        const regFromArr = regions.find(r => r.label === d.label);
        objDocItem.saveData({ order: regFromArr.id });
      });
      console.log('Объекты отправлены на создание');
    }
  };
}